Repository: rostock/ckanext-hro_theme
Catalog: ckanext/hro_theme/i18n/*/LC_MESSAGES/ckanext-hro_theme.po
Languages: de

source: API info
de: API-Nutzung

source: Privacy policy
de: Datenschutz

source: Imprint
de: Impressum

source: Terms of use
de: Nutzungsbedingungen

source: <strong>Powered by</strong> <a class="hide-text ckan-footer-logo" href="http://ckan.org">CKAN</a>
de: <strong>Umgesetzt auf Basis von</strong> <a class="hide-text ckan-footer-logo" href="http://ckan.org">CKAN</a>

source: About
de: Hilfe

source: <h2>What is %(site_title)s?</h2> <p>Where exactly is the primary school located that is closest to your home and therefore can be reached by your children without having to cross many roads? Is your place of work directly connected with your home via cycle ways? Will there be road works again on your route to the sports ground next Sunday? Data to answer many, many questions like these is out there on the internet somewhere but it is not always easy to find.</p> <p>%(site_title)s is a web application serving as a catalogue of useful sets of data. It is run by the municipality of Rostock which is also the owner and publisher of the data. You can collect data here for yourself and others to use. Depending on the type of data, %(site_title)s may also be able to host it in a database, and provide some basic visualisation tools.</p> <h2>How does it work?</h2> <p>This site is running a powerful piece of open-source data cataloguing software called <a href="https://ckan.org" target="_blank">CKAN</a>, written and maintained by the <a href="https://okfn.org" target="_blank">Open Knowledge Foundation</a>. Each dataset record on CKAN contains a description of the data and other useful information, such as what formats it is available in, whether it is freely available, and what subject areas the data is about. One can improve or add to this information (CKAN keeps a fully versioned history).</p> <p i18n:msg="">CKAN powers a number of data catalogues on the Internet. <a href="https://datahub.io" target="_blank">The Data Hub</a> is an openly editable open data catalogue, in the style of Wikipedia. The UK Government uses CKAN to run <a href="https://data.gov.uk" target="_blank">data.gov.uk</a>, which currently lists 8,000 government datasets. Official public data from most European countries is listed in a CKAN catalogue at <a href="http://publicdata.eu" target="_blank">publicdata.eu</a>. There is a comprehensive list of catalogues like these around the world at <a href="http://dataportals.org" target="_blank">dataportals.org</a>, which is itself powered by CKAN.</p> <h2>Open data and the Open Knowledge Foundation</h2> <p>Most of the data indexed at %(site_title)s are openly licensed, meaning anyone is free to use or re-use the data however they like. Perhaps someone will take that nice dataset of a city's public art that you found, and add it to a tourist map, or even make a neat app for your phone that will help you find artworks when you visit the city. Open data means more enterprise, collaborative science and transparent government. You can read more about open data in the <a href="http://opendatahandbook.org" target="_blank">Open Data Handbook</a>.</p> <p i18n:msg="">The <a href="https://okfn.org" target="_blank">Open Knowledge Foundation</a> is a non-profit organisation <a href="https://okfn.org/about" target="_blank">promoting</a> open knowledge: writing and improving CKAN is one of the ways we do that. If you want to get involved with its design or code, join the discussion or development <a href="https://ckan.org/contact-us" target="_blank">mailing lists</a>, or take a look at the <a href="https://okfn.org" target="_blank">OKFN</a> site to find out about our other projects.</p>
de: <h2>Was ist %(site_title)s?</h2><p>Wo genau war nochmal die Grundschule, die Ihrem zu Hause am nächsten ist und die Ihre Kinder gut erreichen können, ohne dabei viele Straßen überqueren zu müssen? Können Sie Ihren Arbeitsplatz durchgängig über Fahrradwege erreichen? Werden Sie nächsten Sonntag wieder an der Baustelle warten müssen auf dem Weg zum Sportplatz? Es gibt viele Daten im Internet, die solche und ähnliche Fragen beantworten können – allein sie zu finden ist nicht immer einfach.</p><p>%(site_title)s ist eine Web-Anwendung, die als Katalog für viele nützliche Daten dient. Betrieben wird die Anwendung von der Hansestadt Rostock, die zugleich Eigentümerin und Herausgeberin der Daten ist. Sie können die Anwendung nutzen, um für sich und/oder andere Daten zu suchen, anzuschauen und herunterzuladen. Abhängig von der Art eines Datensatzes bietet %(site_title)s diesen auch als Datenbankinhalt an, sodass Ihnen einige nützliche Statistik- und/oder Visualisierungswerkzeuge zur Verfügung gestellt werden.</p><h2>Wie funktioniert die Anwendung?</h2><p>Die vorliegende Web-Anwendung basiert auf der mächtigen Open-Source-Software <a href="https://ckan.org" target="_blank">CKAN</a>, gepflegt und weiterentwickelt von der <a href="https://okfn.org" target="_blank">Open Knowledge Foundation</a>. Jeder Datensatz in CKAN besteht aus einer Beschreibung der enthaltenen Daten sowie den Daten selbst. Zur Beschreibung zählen wichtige Informationen wie zum Beispiel die Art der Dateiformate, in denen die Daten angeboten werden, die Lizenz, unter der sie stehen, und die Kategorien und Themenbereiche, denen sie zugeordnet sind. Die Daten und deren Beschreibungen können aktualisiert oder ergänzt werden, wobei CKAN stets alle Änderungen aufzeichnet mittels einer automatischen Versionierung.</p><p>CKAN wird von einer großen Anzahl an Datenkatalogen im Internet genutzt. <a href="https://datahub.io" target="_blank">The Data Hub</a> zum Beispiel ist ein von der Öffentlichkeit bearbeitbarer Datenkatalog im Wikipedia-Stil. Die britische Regierung nutzt CKAN, um <a href="https://data.gov.uk" target="_blank">data.gov.uk</a> zu betreiben – zur Zeit mit etwa 8.000 Regierungsdatensätzen. Die offiziellen öffentlichen Daten der meisten europäischen Staaten sind im CKAN-Katalog auf <a href="http://publicdata.eu" target="_blank">publicdata.eu</a> gelistet. Sie finden eine vollständige Liste von Katalogen wie diesem auf <a href="http://dataportals.org" target="_blank">dataportals.org</a>, einer Seite, die ebenfalls mit CKAN betrieben wird.</p><h2>Open Data und die Open Knowledge Foundation</h2><p>Sofern nicht anders angegeben unterliegen die Daten bei %(site_title)s einer freien Lizenz. Das heißt, dass Sie die Daten unter Einhaltung der in den Nutzungsbedingungen festgelegten Konditionen (und die sind alles andere als restriktiv) beliebig verwenden und verwerten können. Vielleicht möchten Sie ja die Daten zur Kunst im öffentlichen Raum nutzen, um eine Smartphone-App zu bauen, die dabei hilft, einen Rundgang durch Rostock kulturell anspruchsvoll zu gestalten? Nur zu! Open Data fördert den Unternehmergeist, gemeinschaftliche Wissenschaft und transparentes Verwaltungshandeln. Mehr zu Open Data erfahren Sie im <a href="http://opendatahandbook.org" target="_blank">Open Data Handbook</a>.</p><p>Die <a href="https://okfn.org" target="_blank">Open Knowledge Foundation</a> ist eine gemeinnützige Organisation zur <a href="https://okfn.org/about/vision" target="_blank">Förderung</a> von offenem Wissen: CKAN zu entwickeln und zu verbessern ist einer der Wege dies zu erreichen. Wenn Sie mit Design oder Code zu CKAN beitragen möchten, so können Sie den <a href="https://ckan.org/contact-us" target="_blank">Entwickler-Mailinglisten</a> beitreten oder die <a href="https://okfn.org" target="_blank">OKFN</a>-Seiten besuchen, um mehr über CKAN und andere Projekte zu erfahren.</p>

source: <p>%(site_title)s not only comes with an intuitive user interface but also with an extensive application programming interface (API). The API facilitates the use of all functionalities provided by the open-source data cataloguing software CKAN which is at the basis of %(site_title)s: searching for datasets, viewing the metadata (descriptive information) of a specific dataset, or filtering the contents of ressources and linking ressources.</p> <p>As both input and output format, the API uses <a href="https://de.wikipedia.org/wiki/JavaScript_Object_Notation" target="_blank">JSON</a>. An example API call (to show the dataset <code>apotheken</code>) looks like this: <a href="%(api_url)s/package_show?id=apotheken" target="_blank">%(api_url)s/package_show?id=apotheken</a>.</p> <p>A detailed description of the application programming interface can be found within the <a href="%(api_doc_url)s" target="_blank">documentation</a> of CKAN.</p> <h2>Searching for datasets and viewing metadata</h2> <p><a href="%(api_url)s/package_search?q=apothek" target="_blank">%(api_url)s/package_search?q=apothek</a></p> <p>On calling the above URL, datasets are searched for containing the search key <code>apothek</code>. During the search process various metadata fields are scanned and therefore all datasets are returned as results that contain the search key in one of their metadata fields.</p> <p>Once the wanted dataset and hence its ID was identified amongst the search results, all the information of the dataset can now be queried by calling the following URL (of which the last part equals the dataset ID):</p> <p><a href="%(api_url)s/package_show?id=652e7b9e-5bb2-4a7e-aeff-12421d3c32a5" target="_blank">%(api_url)s/package_show?id=652e7b9e-5bb2-4a7e-aeff-12421d3c32a5</a>.</p> <p>A (shortened) result, then, could appear as follows:</p> <pre class="well">{ help: […], success: true, result: { id: "652e7b9e-5bb2-4a7e-aeff-12421d3c32a5", name: "apotheken", title: "Apotheken", maintainer: "Hansestadt Rostock – Kataster-, Vermessungs- und Liegenschaftsamt", maintainer_email: "geodienste@rostock.de", […] resources: [ { id: "0c2c4996-afad-4ebe-9a3d-a3a7d7047a4d", name: "Apotheken", url: "https://geo.sv.rostock.de/download/opendata/apotheken/apotheken.csv", format: "CSV", mimetype: "text/x-comma-separated-values", size: "18081", hash: "sha256:e056f7335e2ee420d9485a86c3924b54fff27a2e7edeb4bdd5f6278e8d41ddd6", […] }, […] ], […] tags: [ { id: "fbf2dd06-001b-4788-bd98-168a6df82bd3", name: "Arzneimittel", […] }, […] ], […] groups: [ { id: "08b0e154-77d7-440f-ab7b-70511004a405", name: "gesundheit", title: "Gesundheit", […] }, […] ], […] }</pre> <p>The output is very comprehensive and should be analysed in detail during the first queries. The most important information in the above (shortened) result is: <ul> <li>A ressource in CSV file format is available under <a href="https://geo.sv.rostock.de/download/opendata/apotheken/apotheken.csv" target="_blank">https://geo.sv.rostock.de/download/opendata/apotheken/apotheken.csv</a>. It is 18081 bytes in size. What is very important in terms of a ressource is its hash value which can be used for proving the integrity of the file.</li> <li>The tags (key words) assigned to this dataset are of interest particularly for searching purposes.</li> <li>The dataset is allocated to category <code>08b0e154-77d7-440f-ab7b-70511004a405</code>. A list of all datasets or further information of a certain category can be viewed either by using the web interface or by calling the API: <a href="%(api_url)s/group_show?id=08b0e154-77d7-440f-ab7b-70511004a405" target="_blank">%(api_url)s/group_show?id=08b0e154-77d7-440f-ab7b-70511004a405</a>.</li> <li>The dataset provides a description with additional details such as the update interval or information about the contents of the ressources.</li> </ul> </p> <h2>Filtering the contents of ressources and linking ressources</h2> <p>Particularly when mobile devices are used or when only a low data transfer rate is available, it is advantageous to be able to download specific extracts of ressources (i.e. to filter ressources) and not having to download the complete ressources: The CKAN DataStore which is enabled for certain ressources provides the functionality of filtering. To check whether the DataStore is enabled for a certain ressource either the web interface can be used (via the site listing all the details of the ressource) or the API can be called by passing the correspondent ressource ID (e.g. the ID <code>290cdf3c-33eb-44a8-963e-65a0ee140a45</code>): <a href="%(api_url)s/datastore_search?resource_id=290cdf3c-33eb-44a8-963e-65a0ee140a45" target="_blank">%(api_url)s/datastore_search?resource_id=290cdf3c-33eb-44a8-963e-65a0ee140a45</a>. The output will consist either of an error message (if the DataStore is not enabled) or of all the contents of the DataStore for this particular ressource.</p> <p>If the DataStore is enabled for a certain ressource, either simple operations can be executed (with the already shown <code>datastore_search</code> function) or more complex operations such as SQL queries can be executed (with the <code>datastore_search_sql</code> function). When using SQL queries, all columns that shall be presented in the result must be explicitly indicated: otherwise errors may arise.</p> <p>A simple example for linking two datasets by means of location and, at the same time, for filtering the contents based on location as well could appear as follows:</p> <pre class="well">SELECT bezeichnung, strasse_name, hausnummer, hausnummer_zusatz FROM "0c2c4996-afad-4ebe-9a3d-a3a7d7047a4d" WHERE ST_Within(ST_Transform(geometrie,25833),ST_Buffer(ST_Transform((SELECT geometrie FROM "e614d725-4fad-4447-820d-4475ca55cff5" WHERE bezeichnung = 'Deutsche Med'),25833),300))</pre> <p>This command can be executed via the API by calling the following URL:</p> <p><a target="_blank" href="%(api_url)s/datastore_search_sql?sql=SELECT%%20bezeichnung,%%20strasse_name,%%20hausnummer,%%20hausnummer_zusatz%%20FROM%%20%%220c2c4996-afad-4ebe-9a3d-a3a7d7047a4d%%22%%20WHERE%%20ST_Within(ST_Transform(geometrie,25833),ST_Buffer(ST_Transform((SELECT%%20geometrie%%20FROM%%20%%22e614d725-4fad-4447-820d-4475ca55cff5%%22%%20WHERE%%20bezeichnung%%20=%%20%%27Deutsche%%20Med%%27),25833),300))">%(api_url)s/datastore_search_sql?sql=SELECT bezeichnung, strasse_name, hausnummer, hausnummer_zusatz FROM "0c2c4996-afad-4ebe-9a3d-a3a7d7047a4d" WHERE ST_Within(ST_Transform(geometrie,25833),ST_Buffer(ST_Transform((SELECT geometrie FROM "e614d725-4fad-4447-820d-4475ca55cff5" WHERE bezeichnung = 'Deutsche Med'),25833),300))</a></p> <p>A detailed description of the DataStore API can be found within the <a href="%(datastore_api_doc_url)s" target="_blank">documentation</a> of CKAN.</p>
de: <p>%(site_title)s verfügt neben der intuitiven Web-Oberfläche über eine umfassende Programmierschnittstelle (API), mit der alle Funktionen der zugrundeliegenden Open-Source-Software CKAN genutzt werden können – sei es das Suchen von Datensätzen, das Anzeigen von Metadaten (beschreibenden Informationen) eines bestimmten Datensatzes, die Filterung des Inhaltes von Ressourcen oder die Verknüpfung von Ressourcen.</p> <p>Die API nutzt sowohl als Eingabe- als auch als Ausgabeformatierung <a href="https://de.wikipedia.org/wiki/JavaScript_Object_Notation" target="_blank">JSON</a>. Ein beispielhafter Aufruf der API (Beispiel: Anzeigen des Datensatzes <code>apotheken</code>) lautet: <a href="%(api_url)s/package_show?id=apotheken" target="_blank">%(api_url)s/package_show?id=apotheken</a>.</p> <p>Eine vollständige Übersicht zur Programmierschnittstelle findet sich in der <a href="%(api_doc_url)s" target="_blank">Dokumentation</a> von CKAN.</p><h2>Datensätze suchen und deren Metadaten anzeigen</h2> <p><a href="%(api_url)s/package_search?q=apothek" target="_blank">%(api_url)s/package_search?q=apothek</a></p> <p>Wenn obige URL aufgerufen wird, werden Datensätze gesucht, die auf den Suchbegriff <code>apothek</code> passen. Es werden dabei diverse Metadatenfelder durchsucht und falls ähnliche Begriffe gefunden werden, gelten diese ebenfalls als Treffer.</p> abgerufen werden. Dazu kann folgende URL aufgerufen werden, wobei der letzte Teil der ID des Datensatzes entspricht:</p> <p><a href="%(api_url)s/package_show?id=652e7b9e-5bb2-4a7e-aeff-12421d3c32a5" target="_blank">%(api_url)s/package_show?id=652e7b9e-5bb2-4a7e-aeff-12421d3c32a5</a>.</p> <p>Ein verkürztes Ergebnis dieses Aufrufes könnte folgendermaßen aussehen:</p> <pre class="well">{ help: […], success: true, result: { id: "652e7b9e-5bb2-4a7e-aeff-12421d3c32a5", name: "apotheken", title: "Apotheken", maintainer: "Hansestadt Rostock – Kataster-, Vermessungs- und Liegenschaftsamt", maintainer_email: "geodienste@rostock.de", […] resources: [ { id: "0c2c4996-afad-4ebe-9a3d-a3a7d7047a4d", name: "Apotheken", url: "https://geo.sv.rostock.de/download/opendata/apotheken/apotheken.csv", format: "CSV", mimetype: "text/x-comma-separated-values", size: "18081", hash: "sha256:e056f7335e2ee420d9485a86c3924b54fff27a2e7edeb4bdd5f6278e8d41ddd6", […] }, […] ], […] tags: [ { id: "fbf2dd06-001b-4788-bd98-168a6df82bd3", name: "Arzneimittel", […] }, […] ], […] groups: [ { id: "08b0e154-77d7-440f-ab7b-70511004a405", name: "gesundheit", title: "Gesundheit", […] }, […] ], […] }</pre> <p>Die Antwort ist sehr umfangreich und sollte während der ersten Abfragen ausführlich analysiert werden. Die wichtigsten Informationen aus dem obigen (verkürzten) Resultat sind:</p> <ul><li>Es existiert eine Ressource im Dateiformat CSV, die unter <a href="https://geo.sv.rostock.de/download/opendata/apotheken/apotheken.csv" target="_blank">https://geo.sv.rostock.de/download/opendata/apotheken/apotheken.csv</a> erreichbar ist. Sie ist 18081 Bytes groß. Wichtig bei einer Datei-Ressource ist insbesondere deren Hash-Wert, der genutzt werden kann, um die Integrität der Datei zu prüfen.</li><li>Die Tags (Schlüsselbegriffe), die diesem Datensatz zugeordnet sind, sind vor allem für die Suche interessant.</li><li>Der Datensatz ist unter anderem der Gruppe (Kategorie) <code>08b0e154-77d7-440f-ab7b-70511004a405</code> zugeordnet. Eine Liste aller Datensätze sowie weitere Informationen zu einer Gruppe (Kategorie) können entweder über die Web-Oberfläche oder ebenfalls über die API abgerufen werden: <a href="%(api_url)s/group_show?id=08b0e154-77d7-440f-ab7b-70511004a405" target="_blank">%(api_url)s/group_show?id=08b0e154-77d7-440f-ab7b-70511004a405</a></li><li>Der Datensatz verfügt zudem über eine Beschreibung mit zusätzlichen Hinweisen wie dem Aktualisierungsintervall oder Informationen über den Inhalt der Ressourcen.</li></ul></p><h2>Filterung des Inhaltes von Ressourcen und Verknüpfung von Ressourcen</h2> <p>Insbesondere auf mobilen Geräten oder in Bereichen, in denen nur eine geringe Datentransferrate zur Verfügung steht, ist es von Vorteil, wenn nicht die kompletten Ressourcen heruntergeladen werden müssen, sondern lediglich der in der aktuellen Situation interessante Ausschnitt. Diese Funktion des Filterns wird durch den CKAN-DataStore bereitgestellt, der jedoch nur für ausgewählte Ressourcen verfügbar ist. Um zu prüfen, ob der DataStore für eine Ressource aktiv ist, kann – neben der Detailansicht der Ressource in der Web-Oberfläche – vor allem die API mit der zu prüfenden ID der Ressource aufgerufen werden, beispielsweise für die Ressource mit der ID <code>290cdf3c-33eb-44a8-963e-65a0ee140a45</code>: <a href="%(api_url)s/datastore_search?resource_id=290cdf3c-33eb-44a8-963e-65a0ee140a45" target="_blank">%(api_url)s/datastore_search?resource_id=290cdf3c-33eb-44a8-963e-65a0ee140a45</a>. Die Antwort enthält entweder die Fehlermeldung, dass die Ressource nicht gefunden wurde, oder aber den kompletten Inhalt des DataStore für diese Ressource.</p><p>Ist der DataStore für eine Ressource aktiviert, so können nun entweder mit der bereits gezeigten Funktion <code>datastore_search</code> einfachere Operationen oder mit der Funktion <code>datastore_search_sql</code> umfangreiche Operationen wie etwa SQL-Abfragen durchgeführt werden. Wichtig ist bei den SQL-Abfragen, dass explizit alle Spalten angegeben werden, die im Resultat angezeigt werden sollen, da es ansonsten zu Fehlern kommen kann.</p><p>Ein einfaches Beispiel für eine Verknüpfung zweier Datensätze anhand der räumlichen Lage und eine gleichzeitige Filterung des Inhaltes ebenfalls nach der räumlichen Lage könnte wie folgt aussehen:</p><pre class="well">SELECT bezeichnung, strasse_name, hausnummer, hausnummer_zusatz FROM "0c2c4996-afad-4ebe-9a3d-a3a7d7047a4d" WHERE ST_Within(ST_Transform(geometrie,25833),ST_Buffer(ST_Transform((SELECT geometrie FROM "e614d725-4fad-4447-820d-4475ca55cff5" WHERE bezeichnung = 'Deutsche Med'),25833),300))</pre><p>Dieses Kommando kann über die API folgendermaßen aufgerufen werden:</p><p><a target="_blank" href="%(api_url)s/datastore_search_sql?sql=SELECT%%20bezeichnung,%%20strasse_name,%%20hausnummer,%%20hausnummer_zusatz%%20FROM%%20%%220c2c4996-afad-4ebe-9a3d-a3a7d7047a4d%%22%%20WHERE%%20ST_Within(ST_Transform(geometrie,25833),ST_Buffer(ST_Transform((SELECT%%20geometrie%%20FROM%%20%%22e614d725-4fad-4447-820d-4475ca55cff5%%22%%20WHERE%%20bezeichnung%%20=%%20%%27Deutsche%%20Med%%27),25833),300))">%(api_url)s/datastore_search_sql?sql=SELECT bezeichnung, strasse_name, hausnummer, hausnummer_zusatz FROM "0c2c4996-afad-4ebe-9a3d-a3a7d7047a4d" WHERE ST_Within(ST_Transform(geometrie,25833),ST_Buffer(ST_Transform((SELECT geometrie FROM "e614d725-4fad-4447-820d-4475ca55cff5" WHERE bezeichnung = 'Deutsche Med'),25833),300))</a></p> <p>Eine ausführliche Beschreibung der DataStore-API ist zu finden in der <a href="%(datastore_api_doc_url)s" target="_blank">Dokumentation</a> von CKAN.</p>
