Repository: rostock/ckanext-hro_theme
Catalog: ckanext/hro_theme/i18n/*/LC_MESSAGES/ckanext-hro_theme.po
Languages: de

source: <h2>Publisher</h2> <p>Municipality of Rostock<br/>Office of the Mayor<br/>Press Office<br/>18050 Rostock<br/><span>telephone:</span> +49 381 381-1417<br/><span>telefax:</span> +49 381 381-9130<br/><span>email:</span> <a href="mailto:presse@rostock.de">presse@rostock.de</a></p> <h2>VAT identification number</h2> <p>DE 137385469</p> <h2>Responsibility</h2> <p>Municipality of Rostock<br/>Office of the Mayor<br/>Ulrich Kunze<br/>Press Officer<br/>Hinter dem Rathaus 5<br/>18050 Rostock<br/><span>telephone:</span> +49 381 381-1418<br/><span>telefax:</span> +49 381 381-9135<br/><span>email:</span> <a href="mailto:ulrich.kunze@rostock.de">ulrich.kunze@rostock.de</a></p> <h2>Concept and technical support</h2> <p>Municipality of Rostock<br/>Land Registry Office<br/>Holbeinplatz 14<br/>18069 Rostock<br/><span>telephone:</span> +49 381 381-6281<br/><span>telefax:</span> +49 381 381-6902<br/><span>email:</span> <a href="mailto:opendata.hro@rostock.de">opendata.hro@rostock.de</a></p> <h2>Licensing terms</h2> <p>This web application offered by the municipality of Rostock is based on <a href="https://ckan.org" target="_blank">CKAN</a>, a web-based system for the storage and distribution of data. The original author of CKAN is the <a href="https://okfn.org" target="_blank">Open Knowledge Foundation</a>. It published its work under the <a rel="license" href="http://www.gnu.org/licenses/agpl-3.0.html" target="_blank">GNU Affero General Public License 3.0</a> (AGPL 3.0).</p> <p>The custom CKAN-template for this web application is published <a href="https://github.com/rostock/ckanext-hro_theme" target="_blank">here</a> under the AGPL 3.0.</p> <h2>Offered data and content</h2> <p>The municipality of Rostock takes no liability for the correctness, integrity or actuality for the data and content offered via this web application. Most notably, the municipality of Rostock takes no liability for any damages arising from using or not using use either this web application or any of its data or content. Furthermore, the municipality of Rostock reserves the right to change, delete or unpublish either this web application or its data or content without any special announcement.</p> <h2>Third party links</h2> <p>The municipality of Rostock takes no responsibility or liability for the content and activities of linked third party sites. Responsible for those sites is their respective owner. Nonetheless, the municipality of Rostock seeks to protect the integrity of this web application and welcomes any feedback about linked third party sites.</p> <h2>Copyright</h2> <p>The data owned by the municipality of Rostock and offered via this web application are, unless otherwise specified, made available under the <a rel="license" href="https://creativecommons.org/publicdomain/zero/1.0" target="_blank">Creative Commons Zero Universal 1.0 Public Domain Dedication</a> (CC0 1.0). This means that you can do what ever you want with the data without having to ask for further permission.</p> <p>The ORKa.MV map, owned by the municipality of Rostock and offered via this web application, is made available under the <a rel="license" href="https://creativecommons.org/licenses/by/4.0" target="_blank">Creative Commons Attribution 4.0 International</a> (CC BY 4.0). This means that you are free to copy, distribute and transmit the map, to adapt the map, and to make commercial use of the map as long as you attribute the map in the following manner: © Hansestadt Rostock (CC BY 4.0).</p> <p>The other content owned by the municipality of Rostock and offered via this web application is made available under CC BY 4.0. This means that you are free to copy, distribute and transmit the other content, to adapt the other content, and to make commercial use of the other content as long as you attribute the other content in the following manner: © Hansestadt Rostock (CC BY 4.0).</p> <h2>Links to this web application</h2> <p>Links to this web application by third parties are explicitly welcome.</p> <h2>Accessibility</h2> <p>The municipality of Rostock aims to keep its web applications accessible for everyone.</p> <h2>Using the contact information</h2> <p>The municipality of Rostock prohibits the unsolicited usage of its contact information published here.</p> <h2>Contact</h2> <p>Please feel free to address your questions, wishes or suggestions to:<br/><a href="mailto:opendata.hro@rostock.de">opendata.hro@rostock.de</a></p>
de: <h2>Herausgeberin</h2> <p>Hansestadt Rostock<br />Büro des Oberbürgermeisters<br />Presse- und Informationsstelle<br />18050 Rostock<br /><span>Telefon:</span> +49 381 381-1417<br /><span>Telefax:</span> +49 381 381-9130<br /><span>E-Mail:</span> <a href="mailto:presse@rostock.de">presse@rostock.de</a></p> <h2>Umsatzsteuer-Identifikationsnummer gemäß § 27a Umsatzsteuergesetz</h2> <p>DE 137385469</p> <h2>Verantwortung gemäß § 7 Abs. 1 Telemediengesetz</h2> <p>Hansestadt Rostock<br />Büro des Oberbürgermeisters<br />Ulrich Kunze<br />Pressesprecher Presse- und Informationsstelle<br />Hinter dem Rathaus 5<br />18050 Rostock<br /><span>Telefon:</span> +49 381 381-1418<br /><span>Telefax:</span> +49 381 381-9135<br /><span>E-Mail:</span> <a href="mailto:ulrich.kunze@rostock.de">ulrich.kunze@rostock.de</a></p> <h2>Konzept, Betreuung und technische Realisierung</h2> <p>Hansestadt Rostock<br />Kataster-, Vermessungs- und Liegenschaftsamt<br />Holbeinplatz 14<br />18069 Rostock<br /><span>Telefon:</span> +49 381 381-6281<br /><span>Telefax:</span> +49 381 381-6902<br /><span>E-Mail:</span> <a href="mailto:opendata.hro@rostock.de">opendata.hro@rostock.de</a></p> <h2>Lizenzbestimmungen</h2> <p>Das vorliegenden Angebot der Hansestadt Rostock basiert auf <a href="https://ckan.org" target="_blank">CKAN</a>, einem webbasierten System zum Speichern und Verteilen von Daten. Die Autorin von CKAN ist die <a href="https://okfn.org" target="_blank">Open Knowledge Foundation</a>. Ihr Werk ist veröffentlicht unter der freien <a rel="license" href="http://www.gnu.org/licenses/agpl-3.0.html" target="_blank">GNU Affero General Public License 3.0</a>.</p> <p>Die angepasste CKAN-Oberfläche des vorliegenden Angebots ist <a href="https://github.com/rostock/ckanext-hro_theme" target="_blank">hier</a> veröffentlicht unter der freien AGPL 3.0.</p><h2>Haftung für angebotene Inhalte</h2> <p>Trotz sorgfältigen Recherchen und Prüfungen übernimmt die Hansestadt Rostock für die Richtigkeit, Vollständigkeit und Aktualität der von ihr angebotenen Inhalte keine Gewähr und keine Haftung. Insbesondere haftet die Hansestadt Rostock nicht für Schäden, die durch die direkte oder indirekte Nutzung oder Nichtnutzung der angebotenen Inhalte verursacht werden. Die Hansestadt Rostock behält es sich ferner ausdrücklich vor, einzelne Inhalte oder das gesamte Angebot ohne gesonderte Ankündigung zu verändern, zu ergänzen, zu löschen oder die Veröffentlichung zeitweise oder endgültig einzustellen. Die Hansestadt Rostock ist als Diensteanbieterin gemäß § 7 Abs. 1 Telemediengesetz (TMG) für ihre eigenen Inhalte, die sie zur Nutzung bereithält, verantwortlich. Gemäß §§ 8 bis 10 TMG ist sie jedoch nicht verpflichtet, von fremden Eigentümern übermittelte oder gespeicherte Inhalte, die sie zur Nutzung bereithält, auf etwaige Rechtsverletzungen zu überprüfen. Gleichwohl verpflichtet sie sich zur umgehenden Entfernung betroffener Inhalte ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung.</p> <h2>Haftung für externe Links</h2> <p>Für die von Dritten angebotenen fremden Inhalte, auf die mittels externer Links verwiesen ist, übernimmt die Hansestadt Rostock keine Gewähr und keine Haftung, da sich diese Inhalte ihrer Einflussnahme entziehen. Verantwortlich für diese Inhalte ist stets der jeweilige Anbieter. Alle mittels externer Links verknüpfte fremde Inhalte wurden zum Zeitpunkt ihrer Verlinkung auf mögliche Rechtsverletzungen überprüft, mit dem Resultat, dass keine konkreten Rechtsverletzungen erkannt wurden. Die kontinuierliche Kontrolle der verlinkten Inhalte allerdings ist ohne Anhaltspunkte für eine konkrete Rechtsverletzung nicht zumutbar. Sollte die Hansestadt Rostock hingegen von einer konkreten Rechtsverletzung Kenntnis erlangen, wird sie die entsprechenden externen Links umgehend entfernen.</p> <h2>Urheberrecht</h2> <p>Die von der Hansestadt Rostock angebotenen und in ihrem Eigentum befindlichen Daten unterliegen, sofern nicht anders angegeben, der gemeinfreien Lizenz <a rel="license" href="https://creativecommons.org/publicdomain/zero/1.0" target="_blank">Creative Commons Zero Universal 1.0 Public Domain Dedication</a> (CC0 1.0). Damit ist alles gestattet, ohne um weitere Erlaubnis bitten zu müssen.</p> <p>Die von der Hansestadt Rostock angebotene und in ihrem Eigentum befindliche ORKa.MV unterliegt der freien Lizenz <a rel="license" href="https://creativecommons.org/licenses/by/4.0" target="_blank">Creative Commons Attribution 4.0 International</a> (CC BY 4.0). Damit ist es gestattet die ORKa.MV zu nutzen, in jedwedem Format oder Medium zu vervielfältigen und weiterzuverbreiten sowie zu remixen, zu verändern und auf der ORKa.MV aufbauen, und zwar für beliebige Zwecke, auch und vor allem kommerziell. Allein der Quellenvermerk ist stets und bei jedweder Art der Nutzung erforderlich und wie folgt auszugestalten: © Hansestadt Rostock (CC BY 4.0).</p> <p>Die von der Hansestadt Rostock angebotenen und in ihrem Eigentum befindlichen sonstigen Inhalte unterliegen der freien Lizenz CC BY 4.0. Damit ist es gestattet die Inhalte zu nutzen, in jedwedem Format oder Medium zu vervielfältigen und weiterzuverbreiten sowie zu remixen, zu verändern und auf den Inhalten aufbauen, und zwar für beliebige Zwecke, auch und vor allem kommerziell. Allein der Quellenvermerk ist stets und bei jedweder Art der Nutzung erforderlich und wie folgt auszugestalten: © Hansestadt Rostock (CC BY 4.0).</p> <h2>Verweise auf angebotene Inhalte</h2> <p>Verweise auf die angebotenen Inhalte durch externe Angebote Dritter sind ausdrücklich erwünscht. Hingegen sind Verweise durch Angebote natürlicher oder juristischer Personen, die verfassungsfeindliche Ziele verfolgen, die eine sittenwidrige Tätigkeit ausüben oder die die Vermarktung von Artikeln mit sittenwidrigem Inhalt betreiben, nicht zulässig.</p> <h2>Barrierefreiheit</h2> <p>Die Hansestadt Rostock verpflichtet sich in ihren Leitlinien zur Stadtentwicklung die zum 26. März 2009 in Deutschland in Kraft getretene Behindertenrechtskonvention der Vereinten Nationen schrittweise umzusetzen. In ihren Internetauftritten achtet die Hansestadt Rostock daher auf die Einhaltung der Barrierefreien Informationstechnik-Verordnung (BITV 2.0).</p> <h2>Nutzung der Kontaktdaten</h2> <p>Der unverlangten Nutzung der in diesem Impressum veröffentlichten Kontaktdaten der Hansestadt Rostock durch Dritte, insbesondere der Zustellung unangeforderter Werbe- oder Informationsmaterialien, widerspricht die Hansestadt Rostock hiermit ausdrücklich. Sie behält sich ferner rechtliche Schritte gegen Dritte im Falle der Zustellung unangeforderter Werbe- oder Informationsmaterialien vor.</p> <h2>Kontakt</h2> <p>Kommentare, Anregungen und Kritik zu dem vorliegenden Angebot der Hansestadt Rostock richten Sie bitte an:<br /><a href="mailto:opendata.hro@rostock.de">opendata.hro@rostock.de</a></p>

source: <h2>Using this web application</h2> <p>You can use this web application offered by the municipality of Rostock completely without having to provide any personally-identifying information.</p> <h2>Establishing contacts with the municipality of Rostock</h2> <p>If you establish contacts with the municipality of Rostock, your personally-identifying information (i.e. name, address, telephone number, email address, etc.) are stored internally and used for its designated purpose only. In any case, your personally-identifying information is protected by the Data Protection Act of Mecklenburg-Western Pomerania. The information will be circulated to third parties only on legal obligation or on obligation caused by judicial decisions or in case of attacks on the internet infrastructure of the municipality of Rostock, as far as necessitated by prosecution. Your personally-identifying information will never be transferred to unaffiliated third parties for commercial or other purposes.</p> <h2>Logging</h2> <p>When you access this web application offered by the municipality of Rostock, the following information is logged:</p> <ul> <li>IP address of the accessing device,</li> <li>name and version of the web browser, name and version of the operating system, and screen resolution of the accessing device,</li> <li>date, time of day, and duration of the access,</li> <li>accessed service, accessed ressource, and applied action,</li> <li>access status,</li> <li>and amount of data transferred.</li> </ul> <p>The information collected is for creating summary statistics only which give an overview of the general usage of this web application or certain parts of it respectively. For the automated creation of the summary statistics the municipality of Rostock uses <a href="https://piwik.org" target="_blank">Piwik</a>, an open-source software web analytics system. Piwik uses cookies which are temporarily stored on the accessing device.</p> <p>The information collected is stored internally and used for its designated purpose only. In any case, the information is protected by the Data Protection Act of Mecklenburg-Western Pomerania. The information will be circulated to third parties only on legal obligation or on obligation caused by judicial decisions or in case of attacks on the internet infrastructure of the municipality of Rostock, as far as necessitated by prosecution. The information will never be transferred to unaffiliated third parties for commercial or other purposes.</p> <h2>Use of cookies</h2> <p>This web application offered by the municipality of Rostock does not make use of cookies.</p> <h2>Security</h2> <p>The municipality of Rostock applies technical as well as organisational precautions to this web application in order to protect stored and used information against unintentional or intentional manipulation, loss or deletion and against access of unaffiliated third parties. The precautions are being improved continuously according to technological progress.</p>
de: <h2>Nutzung des vorliegenden Angebotes der Hansestadt Rostock</h2> <p>Die Nutzung des vorliegenden Angebotes der Hansestadt Rostock ist ohne Angabe personenbezogener Daten möglich.</p> <h2>Kontaktaufnahme mit der Hansestadt Rostock</h2> <p>Bei einer Kontaktaufnahme mit der Hansestadt Rostock werden personenbezogene Daten (Name, Anschrift, Telefonnummer, E-Mail-Adresse etc.) nur intern und nur zu ihrem vorgesehenen Zweck gespeichert und verwendet. Sie unterliegen dem DSG M-V. Eine Weitergabe an Dritte erfolgt ausschließlich bei gesetzlicher oder durch Gerichtsentscheidung hervorgerufener Verpflichtung oder im Falle von Angriffen auf die Internetinfrastruktur der Hansestadt Rostock, soweit eine Rechts- oder Strafverfolgung dies erfordert. Eine Weitergabe zu kommerziellen oder anderen Zwecken erfolgt nicht.</p> <h2>Protokollierung</h2> <p>Wenn Sie auf das vorliegende Angebot der Hansestadt Rostock zugreifen, werden folgende Zugriffsdaten protokolliert:</p> <ul><li>die IP-Adresse des zugreifenden Gerätes,</li> <li>die Beschreibung des Webbrowsers, des Betriebssystems und der Bildschirmauflösung des zugreifenden Gerätes,</li> <li>Datum, Uhrzeit sowie Zeitdauer des Zugriffs,</li> <li>der aufgerufene Dienst, die aufgerufene Ressource und die verwendete Aktion,</li> <li>der Zugriffsstatus sowie</li> <li>die übertragene Datenmenge.</li> </ul> <p>Die Protokollierung der Zugriffsdaten dient ausschließlich statistischen Zwecken, um auf diese Weise einen Überblick über die Nutzung des vorliegenden Angebotes allgemein respektive einzelner Bestandteile davon im Speziellen zu erhalten. Für die automatisierte Durchführung der statistischen Auswertung nutzt die Hansestadt Rostock unter anderem <a href="https://piwik.org" target="_blank">Piwik</a>, ein Open-Source-Programm zur Webanalytik. Piwik verwendet Cookies, die auf dem zugreifenden Gerät gespeichert werden.</p> <p>Die Zugriffsdaten werden nur intern und nur zu ihrem vorgesehenen Zweck gespeichert und verwendet. Sie unterliegen dem DSG M-V. Eine Weitergabe an Dritte erfolgt ausschließlich bei gesetzlicher oder durch Gerichtsentscheidung hervorgerufener Verpflichtung oder im Falle von Angriffen auf die Internetinfrastruktur der Hansestadt Rostock, soweit eine Rechts- oder Strafverfolgung dies erfordert. Eine Weitergabe zu kommerziellen oder anderen Zwecken erfolgt nicht.</p> <h2>Einsatz von Cookies</h2> <p>Das vorliegende Angebot der Hansestadt Rostock verwendet keine Cookies. </p> <h2>Sicherheit</h2> <p>Die Hansestadt Rostock setzt für das vorliegende Angebot technische und organisatorische Sicherheitsmaßnahmen ein, um gespeicherte und verwendete Daten gegen zufällige oder Die Sicherheitsmaßnahmen werden entsprechend der technologischen Entwicklung fortlaufend verbessert.</p>

source: Welcome to {0}!
de: Willkommen bei {0}!

source: The municipality of Rostock collects and manages a multitude of data. These data have huge potential for innovations as long as they are published as open data so that everyone is free to copy, distribute and use the data, to produce works from the data, and to modify, transform and build upon the data, especially for commercial use. This web application serves as a central platform for publishing open data collected by the municipality of Rostock.
de: Die Hansestadt Rostock sammelt und pflegt eine Vielzahl von Daten. Diese Daten bergen enormes Potenzial für Innovationen, sofern sie als offene Daten für jedermann frei zugänglich gemacht werden und sie für jegliche Zwecke weiterverwendet und -verbreitet werden können – insbesondere auch für kommerzielle Zwecke. Das vorliegende Portal dient als zentrale Plattform zur Veröffentlichung offener Daten der Hansestadt Rostock.
