Repository: rostock/ckanext-hro_theme
Catalog: ckanext/hro_theme/i18n/*/LC_MESSAGES/ckanext-hro_theme.po
Languages: de

source: <h2>Using the data of the municipality of Rostock</h2> <p>The data owned by the municipality of Rostock and offered via this web application are, unless otherwise specified, made available under the <a rel="license" href="https://creativecommons.org/publicdomain/zero/1.0" target="_blank">Creative Commons Zero Universal 1.0 Public Domain Dedication</a> (CC0 1.0). This means that you can do what ever you want with the data without having to ask for further permission.</p> <h2>Using the ORKa.MV map</h2> <p>The ORKa.MV map, owned by the municipality of Rostock and offered via this web application, is made available under the <a rel="license" href="https://creativecommons.org/licenses/by/4.0" target="_blank">Creative Commons Attribution 4.0 International</a> (CC BY 4.0). This means that you are free to copy, distribute and transmit the map, to adapt the map, and to make commercial use of the map as long as you attribute the map in the following manner: © Hansestadt Rostock (CC BY 4.0).</p> <h2>Using the other content of the municipality of Rostock</h2> <p>The other content owned by the municipality of Rostock and offered via this web application is made available under CC BY 4.0. This means that you are free to copy, distribute and transmit the other content, to adapt the other content, and to make commercial use of the other content as long as you attribute the other content in the following manner: © Hansestadt Rostock (CC BY 4.0).</p> <h2>Using the data of the OpenStreetMap project</h2> <p>The data owned by the contributors of the <a href="http://www.openstreetmap.org" target="_blank">OpenStreetMap</a> project are made available under the <a rel="license" href="https://opendatacommons.org/licenses/odbl" target="_blank">Open Data Commons Open Database License</a> (ODbL). For processing these data the municipality of Rostock uses the open-source software <a href="https://imposm.org" target="_blank">Imposm</a>. In any case, the data has to be attributed in the following manner: © OpenStreetMap (ODbL).</p> <h2>Using the data of the districts and district-like towns of Mecklenburg-Western Pomerania</h2> <p>The data owned by the districts and district-like towns of Mecklenburg-Western Pomerania are protected by copyright. A permission to use this data is present to the municipality of Rostock. In any case, the data has to be attributed in the following manner: © LkKfS-MV.</p> <h2>Using the other content</h2> <p>This web application offered by the municipality of Rostock is based on <a href="https://ckan.org" target="_blank">CKAN</a>, a web-based system for the storage and distribution of data. The original author of CKAN is the <a href="https://okfn.org" target="_blank">Open Knowledge Foundation</a>. It published its work under the <a rel="license" href="http://www.gnu.org/licenses/agpl-3.0.html" target="_blank">GNU Affero General Public License 3.0</a> (AGPL 3.0).</p> <p>The custom CKAN-template for this web application is published <a href="https://github.com/rostock/ckanext-hro_theme" target="_blank">here</a> under the AGPL 3.0.</p> <p>The font used within this web application is called PT Sans. It was created in 2009 by <a href="https://www.paratype.com" target="_blank">ParaType</a> and is published <a href="https://www.paratype.com/public" target="_blank">here</a> under <a rel="license" href="/fonts/license.txt" target="_blank">this license</a>. <p>The icons used within this web application for illustrating the groups of datasets were created by <a href="https://www.seitenbau.com" target="_blank">SEITENBAU</a> and are published <a href="https://github.com/GovDataOfficial/GovDataPortal" target="_blank">here</a> under the AGPL 3.0.</p>
de: <h2>Nutzung der Daten der Hansestadt Rostock</h2> <p>Die von der Hansestadt Rostock angebotenen und in ihrem Eigentum befindlichen Daten unterliegen, sofern nicht anders angegeben, der gemeinfreien Lizenz <a rel="license" href="https://creativecommons.org/publicdomain/zero/1.0" target="_blank">Creative Commons Zero Universal 1.0 Public Domain Dedication</a> (CC0 1.0). Damit ist alles gestattet, ohne um weitere Erlaubnis bitten zu müssen.</p> <h2>Nutzung der ORKa.MV</h2> <p>Die von der Hansestadt Rostock angebotene und in ihrem Eigentum befindliche ORKa.MV unterliegt der freien Lizenz <a rel="license" href="https://creativecommons.org/licenses/by/4.0" target="_blank">Creative Commons Attribution 4.0 International</a> (CC BY 4.0). Damit ist es gestattet die ORKa.MV zu nutzen, in jedwedem Format oder Medium zu vervielfältigen und weiterzuverbreiten sowie zu remixen, zu verändern und auf der ORKa.MV aufbauen, und zwar für beliebige Zwecke, auch und vor allem kommerziell. Allein der Quellenvermerk ist stets und bei jedweder Art der Nutzung erforderlich und wie folgt auszugestalten: © Hansestadt Rostock (CC BY 4.0).</p> <h2>Nutzung der sonstigen Inhalte der Hansestadt Rostock</h2> <p>Die von der Hansestadt Rostock angebotenen und in ihrem Eigentum befindlichen sonstigen Inhalte unterliegen der freien Lizenz CC BY 4.0. Damit ist es gestattet die Inhalte zu nutzen, in jedwedem Format oder Medium zu vervielfältigen und weiterzuverbreiten sowie zu remixen, zu verändern und auf den Inhalten aufbauen, und zwar für beliebige Zwecke, auch und vor allem kommerziell. Allein der Quellenvermerk ist stets und bei jedweder Art der Nutzung erforderlich und wie folgt auszugestalten: © Hansestadt Rostock (CC BY 4.0).</p> <h2>Nutzung der Daten von OpenStreetMap</h2> <p>Die Daten des Projektes <a href="http://www.openstreetmap.org" target="_blank">OpenStreetMap</a>, die von der Hansestadt Rostock angebotenen Inhalten zugrundeliegen, unterliegen der freien Datenbanklizenz <a rel="license" href="https://opendatacommons.org/licenses/odbl" target="_blank">Open Data Commons Open Database License</a> (ODbL). Für die Aufbereitung der Daten verwendet die Hansestadt Rostock die Open-Source-Software <a href="https://imposm.org" target="_blank">Imposm</a>. Der Quellenvermerk ist stets und bei jedweder Art der Nutzung erforderlich und wie folgt auszugestalten: © OpenStreetMap (ODbL).</p> <h2>Nutzung der Daten der Landkreise und kreisfreien Städte in Mecklenburg-Vorpommern</h2> <p>Die Daten der Landkreise und kreisfreien Städte in Mecklenburg-Vorpommern (LkKfS-MV), die von der Hansestadt Rostock angebotenen Inhalten zugrundeliegen, sind durch das Bundesgesetz über Urheberrecht und verwandte Schutzrechte (UrhG) in den jeweils geltenden Fassungen geschützt. Eine Nutzungserlaubnis liegt der Hansestadt Rostock vor. Der Quellenvermerk ist stets und bei jedweder Art der Nutzung erforderlich und wie folgt auszugestalten: © LkKfS-MV.</p> <h2>Nutzung der sonstigen Inhalte</h2> <p>Das vorliegenden Angebot der Hansestadt Rostock basiert auf <a href="https://ckan.org" target="_blank">CKAN</a>, einem webbasierten System zum Speichern und Verteilen von Daten. Die Autorin von CKAN ist die <a href="https://okfn.org" target="_blank">Open Knowledge Foundation</a>. Ihr Werk ist veröffentlicht unter der freien <a rel="license" href="http://www.gnu.org/licenses/agpl-3.0.html" target="_blank">GNU Affero General Public License 3.0</a>.</p> <p>Die angepasste CKAN-Oberfläche des vorliegenden Angebots ist <a href="https://github.com/rostock/ckanext-hro_theme" target="_blank">hier</a> veröffentlicht unter der freien AGPL 3.0.</p><p>Als Schriftart wird im vorliegenden Angebot PT Sans verwendet. Sie wurde von <a href="https://www.paratype.com" target="_blank">ParaType</a> erstellt und ist <a href="https://www.paratype.com/public" target="_blank">hier</a> veröffentlicht unter <a rel="license" href="/fonts/license.txt" target="_blank">dieser Lizenz</a>. <p>Die Piktrogramme zur Illustration der Kategorien von Datensätzen stammen von der <a href="https://www.seitenbau.com" target="_blank">SEITENBAU GmbH</a> und sind <a href="https://github.com/GovDataOfficial/GovDataPortal" target="_blank">hier</a> veröffentlicht unter der freien AGPL 3.0.</p>

source: Private
de: Privat

source: Draft
de: Entwurf

source: Deleted
de: Gelöscht

source: Manage
de: Verwalten

source: Dataset
de: Datensatz

source: Groups
de: Kategorien

source: Activity Stream
de: Aktivitätsanzeige

source: Showcases
de: Datennutzungen

source: This is an old revision of this dataset, as edited at %(timestamp)s. It may differ significantly from the <a href="%(url)s">current revision</a>.
de: Dies ist eine veraltete Version des Datensatzes, bearbeitet zum Zeitpunkt %(timestamp)s. Sie kann unter Umständen erheblich von der <a href="%(url)s">aktuellen Version</a> abweichen.

source: View
de: Vorschauansicht

source: API Endpoint
de: API-Endpunkt

source: Go to resource
de: Zur Ressource gehen

source: URL:
de: Download:

source: From the dataset abstract
de: Aus der Beschreibung des Datensatzes

source: There are no views created for this resource yet.
de: Es existiert noch keine Vorschauansicht für diese Ressource.

source: Not seeing the views you were expecting?
de: Werden Ihnen nicht die erwarteten Vorschauansichten angezeigt?

source: Click here for more information.
de: Klicken Sie hier für weitere Informationen.

source: Here are some reasons you may not be seeing expected views:
de: Es kann folgende Ursachen haben, dass Ihnen nicht die erwarteten Vorschauansichten angezeigt werden:

source: No view has been created that is suitable for this resource
de: Für diese Ressource wurde keine passende Vorschauansicht erstellt.

source: The site administrators may not have enabled the relevant view plugins
de: Der Administrator hat vermutlich die notwendigen Plug-ins nicht aktiviert, die für die Vorschauansicht notwendig sind.

source: If a view requires the DataStore, the DataStore plugin may not be enabled, or the data may not have been pushed to the DataStore, or the DataStore hasn't finished processing the data yet
de: Es kann sein, dass das DataStore-Plug-in nicht aktiviert ist, die Daten nicht in den DataStore überführt worden sind oder der DataStore gerade beschäftigt ist.

source: Additional Information
de: Zusätzliche Informationen

source: Data created
de: Veröffentlichungszeitpunkt der Daten

source: Data last updated
de: Aktualisierungszeitpunkt der Daten

source: License
de: Lizenz

source: DataStore
de: DataStore aktiv

source: yes
de: ja

source: no
de: nein

source: Language
de: Sprache

source: Size
de: Größe

source: Hash
de: Hashwert

source: Datasets
de: Datensätze

source: Add Dataset
de: Datensatz hinzufügen

source: Relevance
de: Relevanz

source: Name Ascending
de: Name (aufsteigend)

source: Name Descending
de: Name (absteigend)

source: Last Modified
de: Zuletzt bearbeitet

source: Popular
de: Beliebtheit

source: API Docs
de: API-Dokumentation

source: full {format} dump
de: vollständiger {format}-Auszug

source: You can also access this registry using the %(api_link)s (see %(api_doc_link)s) or download a %(dump_link)s.
de: Sie können dieses Register auch mittels %(api_link)s aufrufen (siehe %(api_doc_link)s) oder einen %(dump_link)s herunterladen.

source: You can also access this registry using the %(api_link)s (see %(api_doc_link)s).
de: Sie können dieses Register auch mittels %(api_link)s aufrufen (siehe %(api_doc_link)s).

source: Additional Info
de: Zusätzliche Informationen

source: Source
de: Quelle

source: Maintainer
de: Verantwortung

source: Author
de: Autorenschaft

source: State
de: Status

source: Metadata created
de: Veröffentlichungszeitpunkt der Metadaten

source: Metadata last updated
de: Aktualisierungszeitpunkt der Metadaten

source: Explore
de: Entdecken

source: Preview
de: Vorschau

source: More information
de: Mehr Informationen

source: Edit
de: Bearbeiten

source: Resources
de: Ressourcen

source: Tags
de: Schlagworte

source: Remove Filter
de: Filter entfernen

source: Filters
de: Filter

source: Go
de: Weiter

source: No License Provided
de: Keine Lizenz angegeben

source: This dataset satisfies the Open Definition.
de: Dieser Datensatz erfüllt die Anforderungen der Open Definition.

source: {0} statistics
de: {0}-Statistiken

source: Group
de: Kategorie

source: Showcase
de: Datennutzung

source: E.g. environment
de: zum Beispiel: Container

source: Search data
de: Datensuche

source: Search datasets...
de: Datensätze suchen…

source: Show More {facet_type}
de: Alle {facet_type} anzeigen

source: There are no {facet_type} that match this search
de: Für diesen Suchbegriff wurden keine {facet_type} gefunden.

source: No datasets found for "{query}"
de: Keine Datensätze gefunden für den Suchbegriff "{query}"

source: Filter by location
de: Räumlicher Filter

source: Dataset extent
de: Räumliche Abdeckung

source: Clear
de: Zurücksetzen

source: <p class="extra">Please try another search.</p>
de: <p class="extra">Bitte versuchen Sie es mit einem anderen Suchbegriff.</p>

source: Showcases featuring {dataset_name}
de: Datennutzungen für {dataset_name}

source: This resource view is not available at the moment.
de: Diese Ressourcendarstellung/-vorschau kann momentan nicht angezeigt werden.

source: Embed resource view
de: Ressourcendarstellung/-vorschau einbetten

source: You can copy and paste the embed code into a CMS or blog software that supports raw HTML
de: Sie können den unten stehenden Code der Ressourcendarstellung/-vorschau in ein CMS, ein Blog oder eine andere Web-Anwendung, die „Raw HTML“ unterstützt, einbetten.

source: CKAN Data API
de: Daten-API

source: Access resource data via a web API with powerful query support
de: Mit Hilfe der Daten-API können Sie auf Ressourcen direkt zugreifen und haben umfangreiche Suchmöglichkeiten

source: Further information in the <a href="http://docs.ckan.org/en/latest/maintaining/datastore.html" target="_blank">main CKAN Data API and DataStore documentation</a>.</p>
de: Weiterführende Information finden Sie in der <a href="http://docs.ckan.org/en/latest/maintaining/datastore.html" target="_blank">Dokumentation</a> von CKAN.</p>

source: Endpoints
de: API-Endpunkte

source: The Data API can be accessed via the following actions of the CKAN action API.
de: Die Daten-API kann über folgende Schnittstellenbefehle der CKAN-Action-API erreicht werden:

source: Create
de: Erstellen

source: Update / Insert
de: Aktualisieren / Einfügen

source: Query
de: Suchen

source: Query (via SQL)
de: Suchen (mit SQL)

source: Querying
de: Beispiele allgemein

source: Query example (first 5 results)
de: Abfragebeispiel 1 (erste 5 Ergebnisse)

source: Query example (results containing 'jones')
de: Abfragebeispiel 2 (Ergebnisse, die 'jones' enthalten)

source: Query example (via SQL statement)
de: Abfragebeispiel 3 (mit SQL-Befehl)

source: Example: Javascript
de: Beispiel: JavaScript

source: A simple ajax (JSONP) request to the data API using jQuery.
de: Eine einfache AJAX-(JSONP-)Abfrage der Daten-API mittels jQuery:

source: Example: Python
de: Beispiel: Python

source: CKAN Organizations are used to create, manage and publish collections of datasets. Users can have different roles within an Organization, depending on their level of authorisation to create, edit and publish.
de: Mit Hilfe von Organisationen werden Datensätze gruppiert und katalogisiert, die zu derselben bereitstellenden Instanz gehören.

source: What are Groups?
de: Was sind Kategorien?

source: You can use CKAN Groups to create and manage collections of datasets. This could be to catalogue datasets for a particular project or team, or on a particular theme, or as a very simple way to help people find and search your own published datasets.
de: Mit Hilfe von Kategorien werden Datensätze gruppiert und katalogisiert, die zu derselben Thematik gehören.

source: Create datasets, groups and other exciting things
de: Nur als registrierter Benutzer können Sie Änderungen verfolgen oder Datenanfragen stellen.

source: Search organizations...
de: Organisation suchen…

source: No organizations found for "{query}"
de: Keine Organisation gefunden für den Suchbegriff "{query}"

source: Search groups...
de: Kategorie suchen…

source: {number} group found for "{query}"
de: {number} Kategorie gefunden für "{query}"

source: No groups found for "{query}"
de: Keine Kategorie gefunden für den Suchbegriff "{query}"

source: Register for an Account
de: Registrierung

source: Create Account
de: Benutzerkonto erstellen

source: Email
de: E-Mail-Adresse

source: Log in
de: Anmelden

source: Need an Account?
de: Sie haben noch kein Benutzerkonto?

source: Then sign right up, it only takes a minute.
de: Dann können Sie gleich eines erstellen:

source: Create an Account
de: Registrierung

source: Forgotten your password?
de: Sie haben Ihr Passwort vergessen?

source: No problem, use our password recovery form to reset it.
de: Kein Problem, Sie können Ihr Passwort zurücksetzen:

source: Forgot your password?
de: Passwort zurücksetzen

source: Password reset
de: Passwort zurücksetzen

source: Enter your username into the box and we will send you an email with a link to enter a new password.
de: Sie erhalten eine E-Mail mit einem Link zur Eingabe eines neuen Passworts.

source: Please check your inbox for a reset code.
de: Sie sollten nun eine E-Mail erhalten haben mit dem Link zur Eingabe eines neuen Passworts.

source: Simply enter a new password and we'll update your account
de: Geben Sie einfach ein neues Passwort ein. Ihr Benutzerkonto wird dann automatisch aktualisiert.

source: New password
de: Neues Passwort

source: Open data portal of the municipality of Rostock
de: Open-Data-Portal der Hansestadt Rostock
